app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    # 全てのブログを取得する命令
    @posts = Post.all

INSERT INTO "posts" ("content") VALUES ($1) RETURNING "id"  [["content", "test"]]
---
  def create
    @post = Post.create(post_params)
    if @post.save

UPDATE "posts" SET "content" = $1 WHERE "posts"."id" = $2  [["content", "testtest"], ["id", 3]]
---
  def update
    if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
  def destroy
    @post.destroy